// 
// 我忘记把这个文件覆盖到git了.于是重写
// 今天计划 重写Cframeset管理一系列, 因有严重的不兼容老旧写法.
// 修改已经不够了.
// 写后调用lib测试
#include "CFileIndexTable.h"
//----------------------------------------------------------------------
//
// constructor/destructor
//
//----------------------------------------------------------------------

CFileIndexTable::CFileIndexTable()
{
	m_Size = 0;
	m_pIndex = NULL;
}

CFileIndexTable::~CFileIndexTable()
{

	Release();
}

//----------------------------------------------------------------------
//
// member functions
//
//----------------------------------------------------------------------

//----------------------------------------------------------------------
// Init
//----------------------------------------------------------------------
void
CFileIndexTable::Init(WORD count)
{

	if (count == 0)
		return;


	Release();


	m_Size = count;

	m_pIndex = new long[m_Size];

}

//----------------------------------------------------------------------
// Release
//----------------------------------------------------------------------
void
CFileIndexTable::Release()
{
	if (m_pIndex != NULL)
	{

		delete[] m_pIndex;
		m_pIndex = NULL;

		m_Size = 0;
	}
}

//----------------------------------------------------------------------
// Load From File
//----------------------------------------------------------------------
bool
CFileIndexTable::LoadFromFile(ifstream& indexFile)
{
	//------------------------------------------------------

	//------------------------------------------------------
	indexFile.read((char*)&m_Size, 2);

	Init(m_Size);

	//------------------------------------------------------

	//------------------------------------------------------
	for (int i = 0; i < m_Size; i++)
	{
		indexFile.read((char*)&m_pIndex[i], 4);
	}

	return true;
}
